$(function() {
  var lang = 'en';

  if (window.location.href && window.location.href.indexOf('nepali') > -1) {
    lang = 'ne';
  }
  if (window.navigator.language && window.navigator.language.split('-')[0] == 'ne') {
    lang = 'ne';
  }

  var languages = {
    ne: {
      Shuvayatra: "शुभयात्रा",
      About: "विषय",
      Contact: "सम्पर्क",
      Resources: "श्रोतहरु",
      the_safe_journey_app: "वैदेशिक रोजगारमा जाने नेपाली कामदारको लागि शुभयात्रा APP",
      the_shuvayatra_mobile_app: "सुरक्षित वैदेशिक रोजगारको निमित्त शुभयात्रा APP",
      "E-mail address": "ईमेल टाइप गर्नुहोस्",
      "Get updates": "अपडेट प्राप्त गर्नुहोस्",
      "Information migrants need to stay safe": "सुरक्षित वैदेशिक रोजगारको लागि आवश्यक जानकारीहरु",
      every_day_close: "दैनिक २,००० नेपाली युवाहरु अस्थायीे रोजगारीको खोजीमा नेपालबाट खाडी र पुर्वी एशियाली मुलुकहरु जाने गर्दछन् । ती मध्ये धेरै युवा कामदारहरु वैदेशिक रोजगारका प्रक्रिया र त्यससँग सम्बन्धित कठिनाईहरुबारे अनभिज्ञ भई  शोषण, मानव बेचबिखन र आर्थिक प्रलोभनको शिकार बन्दछन् ।",
      with_nepal_mobile_phone: "नेपालमा झन्डै सत प्रतिसत मोबाईल फोनको प्रयोगकर्ताहरु छन् ।  मोबाईल फोनको माध्यमबाट  वैदेशिक रोजगारलाई सुरक्षित बनाउन सकिन्छ भन्ने  कुरामा हामी विश्वस्त छौ । शुभयात्रा मोबाईल APP मा वैदेशिक रोजगार सम्बन्धित विज्ञ, कानुनी विशेषज्ञ र वैदेशिक कामदारको अनुभवबाट निर्मित यी श्रव्य, दृश्य तथा लिखित जानकारी प्रदान गर्न सकिन्छ । यस शुभयात्राको माध्यमबाट निम्न विषयमा जानकारी प्राप्त गर्न सकिन्छ ।",
      "Labor rights and working conditions abroad": "कामदारको अधिकार र कामका अवस्था र वातवरण",
      "Work permits and the application process": "श्रम स्वीकृति  र निवेदन प्रक्रिया",
      local_dos_and_donts: "साउदी अरब, मलेशिया र कतारमा गर्न हुने र नहुने कार्यहरु",
      unique_women_content: "महिला : वैदेशिक कामदारको लागि",
      "Local knowledge": "स्थानिय ज्ञान",
      live_streaming_model: "शुभयात्राको प्रतिरूप यसरी तयार पारीएको छ, जसबाट प्रयोगकर्ताले खोजेका वैदेशिक रोजगार सम्बन्धि जानकारीहरु तुरुन्तै नेपाली भाषामा प्राप्त गर्न सकिनेछ ।",
      "Trusted information": "उपयुक्त जानकारी",
      our_partners: "हाम्रा साझेदारहरुको दशकौको अनुभव यस ब्एए मा समेटीएको छ । यसका सबै जानकारीहरु वैदेशीक रोजगारमा जाने कामदारका लागि उचित  र उपयोगी छन् ।",
      "Global network": "विश्वव्यापी सन्जाल",
      in_app_social_media: "यस APP मा सामाजिक सन्जालको सुविधा छ, जसले गर्दा वैदेशीक रोजगारमा गएका कामदारहरुले आफ्नु ज्ञान र अनुभव विश्वोब्यपी रुपमा आदानप्रदान गर्न सक्छन् ।",
      learn_more: "थप् जान्नुहोस्",
      "Contact Us": "संपर्क गर्नुहोस्",
      backed_by_taf: 'शुभयात्राास <a href="http://asiafoundation.org/">द एशिया फाउण्डेसन</a>, <a href="http://nrna.org.np">गैर आवासिय नेपाली संघ</a> र विभिन्न नेपाली नविनकर्ता र सामाजिक उद्धमीहरुको समर्थनको प्रतिफल हो । सन् २०१६ मा शुभयात्रामा अझ धेरै विषयवस्तु समेटेर धेरै भन्दा धेरै नेपाली कामदारको जीवनमा सकारात्मक प्रभाव पार्ने उदेश्य राखेका छौ । हाम्रा प्रगति बारे जानकारी लिन, हामीलाई शुभयात्रा APP को सामाजिक सन्जालमा फेसबुक, ट्वीटर र यु-टिउबमा फलो गर्नुहोस् वा निम्न लिन्क क्लिक गरी हामीलाई सम्पर्क गर्नुहोला ।',
      welcome_collaboration: "हामी तपाईंसँग हरेक क्षणमा सहकार्य र सहयात्रा गर्न तत्पर छौंं । यदी तपाईंं पनि हामी जस्तै विश्व भरीका नेपाली कामदारको दिगोे विकासमा सङ्लग्न हुन चाहनु हुन्छ भने, तपाईंलाई स्वागत छ । हामीलाई देश र विदेशका  कामदारलाई सहयोग गर्न साथ दिनुहोस् ।",

      r_and_d: "श्रोत र तत्थ्यांकहरु",
      the_team: "शुभयात्राले सत्य र तत्थ्यांकको माध्यमबाट आप्रावासनको समस्यालाई निउनिकरण गर्ने बिजोड तरिका अपनाएको छ। यसले आप्रावासी काम्दारलाई मात्र नभइ हामी जस्तै काम गर्ने अरु सबैलाई मद्दत् गर्नेछ। हामीले विगतमा पनि एशियाली आप्रवासी काम्दारले भोग्नु पर्ने समस्याबारे विभरण तयार पारेका थियौं जस्ले सरकारी र गैर सरकारी संस्थाहरुलाई आप्रवासन सम्बन्धी कार्य गर्न दिशानिर्देश गरेको छ।  यस्तै  खुलस्त नितीबाट अघि बड्दई हामी आगामी दिनहरुमा पनि शुभयात्राको माध्यमबाट सत्य र तथ्यहरुलाई सबैमाझ प्रस्तुत गर्ने छौं ।",
      explore_publications: "हाम्रा प्रकाशनहरुलाई हेर्नुहोस्",
      "Who we are": "हामी को हौं ?",
      taf: '<a href="http://asiafoundation.org/">द एशिया फाउण्डेसन</a> एउटा अन्तराष्ट्रिय गैर सरकारी संस्था हो, जस्को कार्यलयहरु १८ वटा एशियाली मुलुकहरुमा फैलिएका छन्, त्यी मध्ये एउटा स्थाई कार्यालय काठमाडौंमा पनि छ। नेपालमा फाउनडेशनले अमेरिकि जनताको सहयोग (युएस्एड) द्वारा सन्चालित मानव बेचविखन विरुद्धको (सीटिफ) कार्यक्रम लागु गरेको छ। यो कार्यत्रमद्वारा बेचबिखनको रोकथाम, बेचबिखनमा परेकाहरुको संरक्षण र बेचबिखनमा संलग्न भएकालाई कारवाही गरिन्छ। बेच बिखन र आप्रवासनको सहसम्बन्ध भएकाले सन् २०१४ मा फाउनडेशनले आफ्नो कार्य क्षेत्रलाई विस्तार गरी श्रम तथा रोजगार मन्त्रालयलाई पहिलो आप्रवासनको अवस्था सम्बन्धी विभरण तयार गर्न सहयोग गरेको थियो।  सो विभरणको दोश्रो भाग (२०१४(२०१५)  निकाल्न  फाउनडेशन आइ। ओ। एम र आइ। एल । ओ सँग सहकार्य गर्दै आएको छ।',
      nrna: '<a href="http://nrna.org.np">गैर आवासिय नेपाली संघ</a> (एन। आर। एन। ए) विदेशमा बस्दै आएका नेपालीहरुको निक्कै ठुलो र विशिष्ट छाता संगठन हो। यस्को अध्यायहरु जम्मा जम्मी ७३ मुलुकहरुमा छन् जस्मा धेरै संख्यामा नेपालहरु वैदेशिक रोजगारका  लागि जाने मुलुकहरु पनि पर्दछन्। यस्का अध्यायहरुको माध्यमबाट एन। आर । एन। ए ले नेपाली आप्रवासीहरुलाई जम्मा पार्दछ र आकाशमिक समयमा आप्रवासीहरुको मद्दत् गर्दछ।  काठमाडौंमा यस संगठनले आप्रवासन र वैदेशिक रोजगार सम्बन्धी महत्वकांक्षी आप्रवासीहरुलाई सुचना प्रदान गर्दछ।  यस्का लागी सो संगठनले काठमाडौंको लेबर भिलेज र अन्तरराष्ट्रिय विमानस्थलमा सुचना केन्द्र चलाई आएको छ। यस्का साथै एन. आर. एन. ए. ले वैदेशिक रोजगारमा जाने काम्दारहरुको हितमा बलियो निती निर्माण गर्न नेपाल सरकारलाई पटक पटक पहल गर्दछ।'
    }
  };

  var polyglot = new Polyglot({ phrases: languages['ne'] });
  var _ = function (word, vars) {
    return polyglot.t(word, vars);
  };

  toNepali = function() {
    setTimeout(function() {
      $(".translatebtn").text("English").attr("href", "?t=" + (new Date() * 1));
      $(".translatebtn")[0].onclick = function() {};
    });
    $(".translate").each(function(i, item) {
      if ($(item).attr("placeholder")) {
        $(item).attr("placeholder", _($(item).attr("placeholder")));
      }
      if ($(item).attr('key')) {
        $(item).html(_($(item).attr('key')));
      } else {
        $(item).text(_($(item).text()));
      }
    });
    $("#aboutlink, #contactlink, .resourcelink").each(function(n, navlink) {
      $(navlink).attr('href', $(navlink).attr('href').replace('/', '/?nepali'));
    });
  };

  if (lang !== 'en') {
    toNepali();
  }
});
